<?
    if ($_POST && $_POST["type"] == "get-tabs-data") {

        $res = [
            [
                "tasbsName" => "Горный велосипед",
                "image" => "/img/images/products/product-1.jpg",
                "title" => "Велосипед STELS Navigator 510 HD 26 2022",
                "description" => [
                    "Данный велосипед с колесами 26 дюймов хорошо подходит высоким подросткам. Прогиб рамы и небольшой размер рамы расчитан на рост от 135 до 165 см.",
                    "Суммарный вес велосипеда был снижен до 16,9 кг, так как рама была изготовлена с учетом использования велосипеда подростками."
                ],
                "spec" => [
                    [
                        "icon" => "",
                        "text" => "Двойной обод"
                    ],
                    [
                        "icon" => "",
                        "text" => "Алюминиевый сплав"
                    ],
                    [
                        "icon" => "",
                        "text" => "Колеса диаметром 26 дюймов"
                    ],
                    [
                        "icon" => "",
                        "text" => "Покрышки 26х1,95n\""
                    ]
                ]
            ],
            [
                "tasbsName" => "Женский велосипед",
                "image" => "/img/images/products/product-2.jpg",
                "title" => "Велосипед SCHWINN Traveler women 2022",
                "description" => [
                    "Женский велосипед со стальной рамой Classic step-true lightweight позволяет девушкам без проблем его перемещать.",
                    "На данном велосипеде имеется 7 скоростей с переключателями от Shimano, а жесткая вилка обеспечивает отличную управляемость. Подходит для катания по асфальтированным поверхностям."
                ],
                "spec" => [
                    [
                        "icon" => "bike",
                        "text" => "Стальная рама"
                    ],
                    [
                        "icon" => "bike",
                        "text" => "Жесткая вилка"
                    ],
                    [
                        "icon" => "bike",
                        "text" => "Защита цепи"
                    ],
                    [
                        "icon" => "bike",
                        "text" => "Колеса диаметром 24 дюймов"
                    ],
                    [
                        "icon" => "bike",
                        "text" => "7 скоростей"
                    ]
                ]
            ]
        ];

        echo json_encode($res);
    }
